#### Задание 1 
#### Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
#### Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [1]:
import pandas as pd
import numpy as np

In [2]:
autors = pd.DataFrame({'autor_id':[1, 2, 3], 'autor_name':['Тургенев', 'Чехов', 'Островский']}, columns=['autor_id', 'autor_name'])

In [3]:
autors

   autor_id  autor_name
0         1    Тургенев
1         2       Чехов
2         3  Островский

In [4]:
book = pd.DataFrame({'autor_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price':[450, 300, 350, 500, 450, 370, 290]}, columns=['autor_id', 'book_title', 'price'])

In [6]:
book

   autor_id            book_title  price
0         1           Отцы и дети    450
1         1                 Рудин    300
2         1     Дворянское гнездо    350
3         2      Толстый и тонкий    500
4         2       Дама с собачкой    450
5         3                 Гроза    370
6         3  Таланты и поклонники    290

#### Задание 2
#### Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [7]:
autors_price = pd.merge(autors, book, on = 'autor_id', how = 'inner')

In [8]:
autors_price

   autor_id  autor_name            book_title  price
0         1    Тургенев           Отцы и дети    450
1         1    Тургенев                 Рудин    300
2         1    Тургенев     Дворянское гнездо    350
3         2       Чехов      Толстый и тонкий    500
4         2       Чехов       Дама с собачкой    450
5         3  Островский                 Гроза    370
6         3  Островский  Таланты и поклонники    290

#### Задание 3
#### Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [10]:
top5 = autors_price.nlargest(5, 'price')

In [11]:
top5

   autor_id  autor_name         book_title  price
3         2       Чехов   Толстый и тонкий    500
0         1    Тургенев        Отцы и дети    450
4         2       Чехов    Дама с собачкой    450
5         3  Островский              Гроза    370
2         1    Тургенев  Дворянское гнездо    350

#### Задание 4
#### Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора.

In [86]:
autors_stat_1 = autors_price.groupby('autor_name').agg({'price':'max'})

In [87]:
autors_stat_1

            price
autor_name
Островский    370
Тургенев      450
Чехов         500

In [88]:
autors_stat_1 = autors_stat_1.reset_index()
autors_stat_1 = autors_stat_1.rename(columns={'price':'max_price'})

In [89]:
autors_stat_1

   autor_name  max_price
0  Островский        370
1    Тургенев        450
2       Чехов        500

In [90]:
autors_stat_2 = autors_price.groupby('autor_name').agg({'price':'min'})

In [91]:
autors_stat_2

            price
autor_name
Островский    290
Тургенев      300
Чехов         450

In [92]:
autors_stat_2 = autors_stat_2.reset_index()
autors_stat_2 = autors_stat_2.rename(columns={'price':'min_price'})

In [93]:
autors_stat_2

   autor_name  min_price
0  Островский        290
1    Тургенев        300
2       Чехов        450

In [94]:
autors_stat_3 = autors_price.groupby('autor_name').agg({'price':'mean'})

In [95]:
autors_stat_3

                 price
autor_name
Островский  330.000000
Тургенев    366.666667
Чехов       475.000000

In [96]:
autors_stat_3 = autors_stat_3.reset_index()
autors_stat_3 = autors_stat_3.rename(columns={'price':'mean_price'})

In [97]:
autors_stat_3

   autor_name  mean_price
0  Островский  330.000000
1    Тургенев  366.666667
2       Чехов  475.000000

In [101]:
autors_stat = pd.concat([autors_stat_1, autors_stat_2, autors_stat_3], axis = 0, ignore_index=True)

In [102]:
autors_stat

   autor_name  max_price  min_price  mean_price
0  Островский      370.0        NaN         NaN
1    Тургенев      450.0        NaN         NaN
2       Чехов      500.0        NaN         NaN
3  Островский        NaN      290.0         NaN
4    Тургенев        NaN      300.0         NaN
5       Чехов        NaN      450.0         NaN
6  Островский        NaN        NaN  330.000000
7    Тургенев        NaN        NaN  366.666667
8       Чехов        NaN        NaN  475.000000